МП/src/DataProcessors/ГрафикНапоминаний/ГрафикНапоминаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрафикНапоминаний</name>
</mdclass:DataProcessor>

МП/src/InformationRegisters/Напоминания/Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Напоминания</name>
  <resources>
    <name>ДатаНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНапоминания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзначальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/DataProcessors/ГрафикНапоминаний/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)//Ден  2016 10 24 ---
	ОбновитьДерево();
КонецПроцедуры

&НаСервере 
Процедура ОбновитьДерево()//Ден  2016 10 27 ---

	
	ВерхнийУровень = список.ПолучитьЭлементы();
	ВерхнийУровень.Очистить();
	Сегодня = ВерхнийУровень.Добавить();
	Сегодня.Напоминание = "Сегодня";
	Завтра = ВерхнийУровень.Добавить();
	Завтра.Напоминание = "Завтра";
	Неделя = ВерхнийУровень.Добавить();
	Неделя.Напоминание = "7 дней";
	Далее = ВерхнийУровень.Добавить();
	Далее.Напоминание = "Далее";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрСведенийНапоминания.Элемент КАК Элемент,
		|	РегистрСведенийНапоминания.Комментарий КАК Комментарий,
		|	РегистрСведенийНапоминания.ДатаНапоминания КАК ДатаНапоминания,
		|	РегистрСведенийНапоминания.ВремяНапоминания КАК ВремяНапоминания,
		|	РегистрСведенийНапоминания.Периодичность КАК Периодичность,
		|	РегистрСведенийНапоминания.ИзначальнаяДата КАК ИзначальнаяДата,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(РегистрСведенийНапоминания.ДатаНапоминания, ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА 1
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(РегистрСведенийНапоминания.ДатаНапоминания, ДЕНЬ, -1), ДЕНЬ) = &ТекущаяДата
		|			ТОГДА 2
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(РегистрСведенийНапоминания.ДатаНапоминания, ДЕНЬ, -7), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Срок
		|ИЗ
		|	РегистрСведений.Напоминания КАК РегистрСведенийНапоминания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНапоминания";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Напоминание = строка(Выборка.ДатаНапоминания) + " " + Выборка.Элемент + " " + Выборка.Комментарий; 
		Если Выборка.Срок = 1 Тогда
			Родитель = Сегодня;
		ИначеЕсли Выборка.Срок = 2 Тогда
			Родитель = Завтра;
		ИначеЕсли Выборка.Срок = 3 Тогда
			Родитель = Неделя;
		Иначе
			Родитель = Далее;
		КонецЕсли;
		Нстр = Родитель.ПолучитьЭлементы().Добавить();
		Нстр.Напоминание = Напоминание;
		ЗаполнитьЗначенияСвойств(Нстр,Выборка);
	КонецЦикла;
	
КонецПроцедуры//

&НаКлиенте
Процедура Обновить(Команда)//Ден  2016 10 27 ---
	ОбновитьДерево();
	Для каждого Строка Из Список.ПолучитьЭлементы() Цикл
		элементы.Список.Развернуть(Строка.получитьИдентификатор(),истина); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)//Ден  2016 10 27 ---
	ТекущиеДанные = Элемент.ТекущиеДанные;	
	Структура = Новый Структура("Ключ", ПолучитьКлюч(ТекущиеДанные.Элемент, ТекущиеДанные.Комментарий));
	ОткрытьФорму("РегистрСведений.Напоминания.Форма.ФормаЗаписи", Структура);
КонецПроцедуры
 
&НаСервере 
Функция ПолучитьКлюч(Элемент, Комментарий)//Ден  2016 10 27 ---
	Возврат РегистрыСведений.Напоминания.СоздатьКлючЗаписи(Новый Структура("Элемент, Комментарий", Элемент, Комментарий));
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)//Ден  2016 10 27 ---
	Для каждого Строка Из Список.ПолучитьЭлементы() Цикл
		элементы.Список.Развернуть(Строка.получитьИдентификатор(),истина); 
	КонецЦикла;
КонецПроцедуры
